{"paging": {"next": "https://graph.facebook.com/v2.0/395931383856469/posts?fields=message&limit=100&type=status&access_token=CAACEdEose0cBAM5EeeCdhgjLVoaRE3cCoM2EvOxSafMex6pUp99doeFekzfTPhSq308iEceop7ObY2cTmXqSpjj160RXZBEZAXOV60Xn1BuPOZBfy00tB6jIyIgOUSZAdPrIWW4YbkvBhj1YVFpCkDWDuvNJHSphqaL8ZA3Ap2mXuYs3ZCmIzwL0gI9Wm5b0y6QfNuuoXN3GBynhWtSir0f1kiExrs6ZCsZD&until=1416234521&__paging_token=enc_AeyP9R4W_ygevrBRGOwCU44uPvUSsWGjpzOfYBhVOLkCOWa6KjtwRl-kiygR1AFZyQltkk7SUSICypzG5f7QFZkNpXHISmBXlIQZcVFc7m6Dew", "previous": "https://graph.facebook.com/v2.0/395931383856469/posts?fields=message&limit=100&type=status&since=1422019099&access_token=CAACEdEose0cBAM5EeeCdhgjLVoaRE3cCoM2EvOxSafMex6pUp99doeFekzfTPhSq308iEceop7ObY2cTmXqSpjj160RXZBEZAXOV60Xn1BuPOZBfy00tB6jIyIgOUSZAdPrIWW4YbkvBhj1YVFpCkDWDuvNJHSphqaL8ZA3Ap2mXuYs3ZCmIzwL0gI9Wm5b0y6QfNuuoXN3GBynhWtSir0f1kiExrs6ZCsZD&__paging_token=enc_Aew3iwyFSMn4xITvJ4s6vjdCGKAbedaxSbN4GXfV8iPu5i2r7zPJnhe__7CAbdkzl6W49EENzXKoXLjzR7N4KkmY7kUGh_vq3oVrUmnf99NS1Q&__previous=1"}, "data": [{"created_time": "2015-01-23T13:18:19+0000", "message": "\"permission to post po admin...\n\nHi gali sa MedTech nga ara kagina sa canteen(01-20-15)....mga 10:30am\nviolet ang iya bag.JANSPORT ata tu xa....=D\nHindi q bal.an qng ano year n'ya... =D\n\nnacute-an lang a.b ko sa iya.... hehehehe\nhai gali....\n\n-walalang.", "id": "395931383856469_702233483226256"}, {"created_time": "2015-01-23T13:18:08+0000", "message": "\" Hello and Hi \n\n Kung sino man po nakakita ng cellphone ko na Cherry Mobile D11 TV, please pakibalik lang po sa DSA o sa mga Guard. Please lang po kailangan ko po kasi yun. Titingin pa naman po kami ng friends ko dun ng Miss Universe 2015 on January 26 to support MJ Lastimosa. Please pakibalik po. I badly need it. Thank you po talaga.\"\n\n-Anonymous", "id": "395931383856469_702233433226261"}, {"created_time": "2015-01-23T13:17:45+0000", "message": "\"Hello sa crush ko nga HRM. Tani mabal-an ko pangalan mo. Lainay bi ta department. Dugay ta na ka wala nakita gakaon sa Food of D Day ba. Ginaabangan ta pa naman ka sa gawas. Cute ka pa gid magsmile lalo na pag gastorya ka sa mga miga mo. Usually abi tuesday kag thursday ka gakaon didto upod friends mo. San-o ka pa mabalik to man? Miss ta na ka.\n\nMisterGwapoKuno, 19\"", "id": "395931383856469_702233373226267"}, {"created_time": "2015-01-23T13:17:20+0000", "message": "\"Hi! di naman ako taga NDMU but I had a Girlfriend na nagaral jan. She took up BS MEDTECH. I don't know kung nagaaral pa ba sya o hindi na but one thing is for sure, madalas syang bumibisita sa site na to. Kung nababasa mo pa to yam, i just wanted to tell you how much i'm missing you right know. sana wag ka ng magalit sakin tsaka I'm hoping magkausap na tayo. sana maayos pa ang lahat satin.\n\n- 10", "id": "395931383856469_702233229892948"}, {"created_time": "2015-01-23T13:16:55+0000", "message": "\"Admin please paki post. \n\nPara sa mga officer  sang marketig! \nTagae  building kami sang nami nga rason nga, 500 god ang marketing nigth?  Tapos sa protect ang  venue,?  Anu difference sang 550 saw fb hotel nga may certificate ,may  raffle, may contest, kag invitation man,, isa pagida ang 280 dati sa city  hall nga may raffle man, contest, kag libre  pa  pamasahe,  te inyo 500? PROTECT LNG?  LIBRE MAN BALA YA VENUE?  PA SEMINAR SEMINAR PAGED KAMU LA MAN GYAPUN NA MAMATI KA SPEAKER  NYO NGA TAGA MANILA  KUNO..EEXPLAIN NYO MAYO PARA KLARO.. \nLIBRE BALA KAMU SA MARKETING NIGTH FEE.. RAMAN MAN? \"\n\n-Anonymous", "id": "395931383856469_702233093226295"}, {"created_time": "2015-01-23T13:16:37+0000", "message": "\"Hindi ko taga NDMU pero may klaruhon lang ko mostly amo gid man na ugali ka mga dameans nga babae da???\nMy G! bastos batasan bal-an nila may tao sa tubangan ko gid sila nagChhinismis kag mgaHIKHIK ngirit kag magIningat nga tono ka boses.!\nsin-o abi hindi mairita nga ara ka sa tunga nila harap-harapan kag magpinadayaw ka gadget nila!!\nduhhh\n\nk!\nsorry lang eh naka-uniform ko sa teritoryo niyo.\n\n#PasikatGurow", "id": "395931383856469_702232973226307"}, {"created_time": "2015-01-23T13:15:53+0000", "message": "\"Mga graduates ng The Sisters of Mary school jan mag pakilala kayo para ma recognize at mainvite sa next na reunion.\n\nBoystown A17...", "id": "395931383856469_702232753226329"}, {"created_time": "2015-01-23T13:15:43+0000", "message": "\"Good pm dameans. Kung sino po nakakita ng envelope ng philhealth na may laman na jersey for funrun nabilin sa doh120. May pangalan po yun. please pakibilin lang sa maingate kay i claim ko lang sa monday salamat!!\n\n-annonymous-", "id": "395931383856469_702232726559665"}, {"created_time": "2015-01-23T13:15:05+0000", "message": "\"Admi paki pOst ty:)\n\nA simple guy always has the best smile \nYan ang na conclude ko, ksi their was this guy na merong JanspOrt na bag color grey something na ganun tpus sa hndi inaasahan bigla lng sya nag smile and then i didn't notice na i was actually starring at him.\nTo the point na naging red ang face ko\nHndi ako nag assume na sa akin sya nag smile pero. . . sana. . .\nNkita ko ksi sya sa business office sa new building, time check 4:38 this jan. 16 syempre 2015 \nTpus napansin ko ang kanyang innocent look, that wOnderful eyelashes na parang nagsasabi na \"\"hi, is there something that i can do for you\"\" na parang ganun.\nCute sya, mas mabuti ksi ang cute kesa sa gwapo dhil kung cute hndi ka madaling magsasawa  tpus dagdagan pa ng cute dimple nya  OMG\nPara lng syang sakura flower na nag fa-fall bago mag winter.\nAnd then bigla lng sya lumakad pgkatpus mag bayad sa businnes office.\n\nI dont exactly knOw his real name but i manage to find out his surname, marami silang surname na kagaya nya but to be specific his in the CBA department. . .\n#Firmalino yung surname nya tpus hndi ako sure kung HRDM ang course nya but im sure na cute sya tpus that OMG na eyelashes...\nPwde akin nlng yung eyelashes mo? Please? Hahahaha\nIm frOm the CED department\nHope for our next meeting :)))) \nHey Firmalino magkikita ulit tayo tiwala lng kay Lord.\nItaga mo yan sa granite na bato. Ahahaha\n\nFrom: Ms. beautiful ng CED  <3 :-*\"", "id": "395931383856469_702232519893019"}, {"created_time": "2015-01-23T13:14:20+0000", "message": "\"GOLDEN STALLION in the backyard\n\nAlumni ako sa NDMU \"\"Golden Stallion Batch\"\" kuno kay ang amun batch ang nagbayad para sa Golden Stallion nga ina. After pila ka tuig nakabisita ako liwat sa NDMU damu na nagbag-o, damu-damu gid. Pero wala gihapon nagbag-o ang isa ka butang nga mahal gid mag-eskwela sa university nga ni. May business transaction lang ko ngaa nakabalik ko liwat didto.\n\nPapuli na ko halin sa bag-o na Business Office nag-decide ko na mag-agi sa likod sang building. Sang galakat ko nakita ko gid dayun ang Golden Stallion nga nakahigda sa hilamunan, natabunan sako kag mga  karton. Bal-an ko gid na hindi didto ang tama na nga pwesto sang ulihi ko to nakit-an. Nakalainan ko maglantaw kay nagsulod sa isip ko nga kwarta namun ang gingamit para sa butang na to. Tapos anu na to siya subong? Gina-junk. Ginatago sa likod kay hindi na bagay sa bag-o nga itsura sang NDMU. \n\nWala na ko nangusisa sa kung kay sin-o, kung anu ang balak nila sa estatwa sang kabayo. Ngaa didto lang nabutang? May ginaplano ba ang management nga ibalhin sa lain nga lugar o may kinanglan ba i-repair, ngaa gin-standby anay didto. Kung ano man ila ginaplano, tane sa mas maayo nga lugar nila ginbutang. Hindi nga amu sato, daw wala lang silbi kung ara lang didto. Matapos nga gastohan sang mga parents kag estudyante mismo sang amun batch daw nabaliwala lang tanan, nasayang lang.\n\nWala ko sang against sa improvement sang NDMU, sa katunayan maproud ka man nga naga-level up kag wala man nagapahuli sa advancement sang society ang eskwelahan nga gintaposan mo. Siguro, isa lang ni sa mga tani dapat nila pansinon o gaan atensyon kag kabay pa aksyon. Hindi porke natapos na, wala na. Ara pa na gihapon, paanu na lang ta kaya subong kung wala sang history/past/nakaraan? Kumo tapos na to sila, limtan na lang sila. Hindi ah. Hindi amu na ang itudlo natun sa masunod pa nga mga henerasyon. Kita mangin maayu nga surun-an nila nga naga-value sa mga butang sang sadto pa, sang sa subong kag sang sa sunod pa nga panahon. \n\nHindi ninyo tani ko tuligsaon sang mga bash kay diri ko nag-paabot sang akon concern instead nga maghatag letter sa office sang concern na department sang school, regarding sang Golden Stallion. Bal-an ko hindi lang mga pang-love story ang page na ni. Venue man sang mga tao na parehas saakon na mapabalo saiban kag salamat kung makalab-ot pa gid sa kina-uukulan/in-charge/may power kag magaan nila aksyon....Salamat, salamat gid. \n\nHail! Notre Dame of Marbel University\n\n*RedHorse*\n2011\nCollege of Engineering\"", "id": "395931383856469_702232306559707"}, {"created_time": "2015-01-23T13:13:12+0000", "message": "\"Marketing Night\nProtect Center\nP 500.00\nMahal gid haw?\nFB hotel dati 550 may raffle naman to kag contest with prizes!\nsa City hall dati 280 may raffle naman to kag contest may prizes man.\ncellphone pa gani to kag etc.\nbakit ngayon 500? libre man bala ya venue??????\n\n-Anonymous", "id": "395931383856469_702231916559746"}, {"created_time": "2015-01-23T13:09:28+0000", "message": "friend kami sato, perme updanay. asta nga\n   crush ko sYA sbng kay na fall nako sa iya, pero ngaa\n daw may balakid gd nga may ga harang.\n gusto ko ma prangka kag i hmbl sa iya sa personal\n nga may gusto ko sa iya. gsto ko sya hagadun magkaon sa gwa \"\"date kumbaga\"\" pero damu sya rason.\n halos tnan nga subj, clssmates kami..\n \n basi kung e hmbl ko sa iya ang tood basi maguba ang frndship nmun. kag nahalata nya na may crush ko sa iya. ky sa ang mga frnds nya nakapansin na sang una tung updanay pa kmi kag sabay2 kmi. asta nga sa sa sunlog2 nga to' alone naku sbng.\nway ko mn sya gna pabay an, kag gna buligan ko mn sya kung anu ang di nya bal an sa subject nga budlay sa iya..\n\nanu himoon ko?\n\n\"\"CBA2ndYRBOY :)", "id": "395931383856469_702230959893175"}, {"created_time": "2015-01-23T13:09:05+0000", "message": "\" Good evening!\nPERMISSION TO POST ADMIN!..\n\ni would like to suggest that our school must need to be a certified ISO 9000 or ISO 14000. kasi tayo yung paaralan na huli nalang parati,, mga retired teachers pumpunta na ng ibang paaralan para na dun magturo like was SIR BULAO, HE Was teaching in ST. ALEXUIS college. \nNDMU should implement that so that many students and professors will remain in our school and will be recognizing by other schools at same level of LA SALLE and UP.\n tapos sana sa enrolment ONLINE na po at di na pupunta ang mga estudyante sa paaralan pabalik2, at gagasto ng pamasahe...\n\n#2ndYEARndmu", "id": "395931383856469_702230856559852"}, {"created_time": "2015-01-23T13:08:00+0000", "message": "\"Tani ma post ini...\nkung ma post. Salamat gid kaayu dako2 na na bulig mo..\n\nHindi ko bal.an kung paano paumpisahan gid ni pero kay ining gina batyag ko dahil sa isa ka babae abi daw lain na gid.. kay hindi pa man kaya sang loob ko na ihambal ini saiya ti i amat amaton ko na lang anay kag paumpisahan dire...\nAko nga klase nga lalake ay ng hindi mo bala matawag nga mapansin gid ah sa public. in short, simple lang ah hiposon man ko kag transferee lang ako pero ga excel man ko sa klase.. 3rd yr irreg.. \nNagumpisa ini sang last sem. kay last sem lang man ko nagbalhin sa NDMU.. \nMag classmates kami sa isa ka subject pang aga to siya. Bag.o2 lang pa gid nga daan to nag start sang klase. Ako gapungko ako sa may atubangan pero nang daw medyo sa gilid-gilid lang ah ag siyempre kay transferee ara inang feeling nga daw wala gusto may magtupad saimo haw..  \nNag abot ini siya nga babae sa room taason, pution pa gid kag siyempre gwapa gid eh inang pag makita mo siya maglakat nang makatulok kag makuha niya gid attensyon mo o basi ako lang gid naka batyag sa to? Daw na love at first sight lang... Tapos amo to nag sulod siya sa classroom kag nangita siya sang pungkuan niya o gapangita siya sang iya nga upod. hindi ko lang bal.an diin sa duwa dira.. tapos una nag pungko sya sa may ika tatlo nga row kay didto tung sa kakilala niya nga lalake... sa isip ko lang ka sayang tani matupad ko siya ba para mainspire man ko magsulod sa klase namon.. tapos napansin ko may nagtawag saiya nga babae sa ka row ko man dapit friend niya siguro.. may bakante man sa tupad ko na pulungkuan kag didto sya nagpungko! baw sa isip ko naman God is good gid ba! nami nami man pa gid kay siya una nag smile saakon kag gin pamangkot nya ako kung may naga pungko sa tupad ko sabat ko man wala kag nag smile man ako saiya... daw si ga lumpat-lumpat lang heart ko ah.. pawala pwala lang ko.. hahahaha kag amo to na tupadanay kami sa klase... tapos sa mga medyo nadugay na nga inadlaw. pansin ko man nga hiposon man gali siya gaistorya man siya pero kis.a lng gid.. pero mahilig siya mag smile daw ka buot gid saiya lnatawon bala.. I fast forward ko na lang.. may ara sa tong time nga na manug quiz kami kag ako man tana klase nga studyante daw kahuruya kay wala takon papel dala! surprise quiz abi to siya amo to ngaa ^_^ napansin niya man kay gin tulok niya ko ti amo to na eh sa isip ko gid tana kahuruya -______- daw nahuya man pa gid ko mangayo sa iya hindi ko na bal.an ano himuon ko wala man ko kakilala pa gid sa to.. nag halimbawa na lang ko pangita papel sa notebook ko eh.. pero amo to napansin niya gani ko gin pamangkot niya ko kung may papel na daw ba ko kay may ara daw siya extra..(kabuot man gali saiya) wala na ko mahimo eh kay manug start na ang quiz ako wala pa papel.. gn hambal ko na lng tood kg gn kuha ko ang papel nga gin alok niya saakon kag nag hambal ako nga salamat. kag siya nag smile na naman...  baw lang gid inang smile nga na daw matunaw man akooooo hayyyyy Lord salamat gid hahahahaa ^_^ kag didto naman nag start kay kis.a may gina pamangkot2 man siya saakon.. ngaa nagtransfer ko ano ko year kag course.. maupod ko pa gid siya kung mag grupo.. mga amo na bala.. ti ako man nga uyon-uyon ko man eh.. ^_^ pero hindi kami grabe ka close tama lang ah.. kag didto na nagumpisa gina batyag ko saiya amat-amat na nga mafall ko.. ako mainspire gid ko nga masulod sa klase kag nang mas mag strive man sa mag eskwela tarong... gin search ko siya sa facebook kag may ara siya dalawa man to nag gwa na account niya so dalawa ang gin sendan ko sang friend request hehehehe gin accept niya man ako dayun! lipay2 man ako eh ^_^  \nNabal.an ko man nga member gali ini siya sang NDMU DANCESPORTS VARSITY.. may activity man to sa school kag required nga mag attend ang mga students kay may attendance.. kag sa program didto ko nakita siya una mag saot.. kgwapa lang gid saiya kag kung mag saot siya saiya lang ko gafocus kay nami ^_^ te plus points pa gid eh! kag sang intrams gin bantayan ko gid siya sang socio kay pag kabalo ko may salihan gid siya eh ti basi masali siya dance sports gihapn.. na kibot lang ko kay sa folkdance siya nagsali kag nami nami gihapon siya lantawon magsaot! grbe gid das.ok ko sa to para lang makita siya kasayang lang kay daw hindi man to sila bi ang nag daog... para saakon sila gid nami! ^_^ \nNabal.an ko man gali kay gin hambal sa tong friend ko. kay siyempre ga puropamangkot man ako eh.. nga bata siya sang isa ka teacher hehehe kag na teacher ko pa gid to si mama niya.. Like mother like daughter gid sila ahh mga gwapahan.. ^_^ Kag didto na amo to ang story ngaa nagustohan ko inang babae nga to.. hindi lang siya gwapa pero mautak man.. she's my type of girl! hehehe ^_^ hindi ko bal.an kung may migo na siya.. hambal bi sang iban na friends ko my ara na daw pro wala ko gpati kay daw gina kadlaw2an lang bi ko nila.. kantsawan ah ^_^ pero kung tood gid man sige lang ah I won't give up! hehehehe ipaglaban ko ni gina batyag ko asta sa maamin ko na sa personal saiya gna batyag ko gid.. bsan sa dira lng mn.. pero siyempre ang pagrespeto ko sa iya ara n gihpon hindi ko gid na pag dulaon.. ^_^ amo na ngaa asta subong gina admire ko gid siya gihapon... buot pa gid to siya kay bisan subong nga wala na kami naga classmatanay nga subject kung makita niya ko sa school gina sapak niya gihpon ko kag gina kamusta.. ^_^ basta makita ko gid na siya pirme nga gaagi sa pantua.. gpasalamat gid ko kay Lord nga na nameet ta ka.. kag salamat man dahil gid didto sa papel nga gin alok mo saakon.. hahahaha hindi ko gid to malimtan.. ^_^\n\nSomeday.. magkaroon na gid ako sang lakas ng loob para mahambal ko saimo ang gina batyag ko...\n\n-1stSEMSEATMATE\"", "id": "395931383856469_702230509893220"}, {"created_time": "2015-01-23T13:07:25+0000", "message": "To whom ut may concern:\n\nIt came to my attention that one or some teachers in NDMU are using facebook for their students assignments. It seem they tell their students to posts their assignments and needs to earn lots if likes. Their grades then depends on how many likes they will get. What about those who doesnt have facebook? Or those who prefer to be private that only use facebook for close family and friends. Isnt it not fair for them to get liw grades because they don't have enough friends to like it? Why not give grades on the assignment itself? The tendency is students will spend more time on facebook rather than doing other stuff or socializing with real friends.\n\n-Anonymous", "id": "395931383856469_702230386559899"}, {"created_time": "2015-01-23T13:05:31+0000", "message": "AdmiN pAkI pOst po :))) ''hi! cRuSh2 q gD bAla tuNg nAg pErfOrm sA teAm herA sa lAnguAge feast. BSA daw course. kAgina kO pA gnA pAngita FB Account nya. Tung pututon bAla nga gwApohun \"kUno.\" pEro Crush ko gId yA!. MJ ba pangalan satu? nA ovErheArd q lAng. Ahahaha. Pa tag plssss .\n\n-Ms. Pink", "id": "395931383856469_702229763226628"}, {"created_time": "2015-01-23T13:04:33+0000", "message": "Hello admin , pwede po bang ipost niyo po tong picture ng wallet na na lost and found \nThankyou po admin.", "id": "395931383856469_702229423226662"}, {"created_time": "2015-01-23T13:03:43+0000", "message": "HELLO People of NDMU ! \nMay alam kayo na bahay na pinaparenta or apartment? Hindi naman gud ako makatiis dito sa dorm namin ui. Grabe karumi ng tubig, cr, at sa lobby. Please, thank you!\n\n-Anonymous", "id": "395931383856469_702229183226686"}, {"created_time": "2015-01-23T13:02:56+0000", "message": "admin paki post po .. sino po pala yung GIA na nagbabantay sa 1st floor? ang cute kasi nya. paki comment po ang name.\n-Anonymous", "id": "395931383856469_702228989893372"}, {"created_time": "2015-01-17T11:53:13+0000", "message": "hi pa post po ako po si ALFIE CALDERON DINOPOL yung guard ng ndmu kUng sino po yung nawalan or naiwan na charger ng loptop kahapon doon sa greegan hall nag ikot ako buti nalang anjan c ARGOTE ng janitorial services nakita at binigay nia sa akin. andon po ang inyong charger sa maingate pakikuha nalang po alam ko importanti yun sa inyo.puntahan nio lang po doon salamat po.", "id": "395931383856469_699605036822434"}, {"created_time": "2015-01-16T03:31:43+0000", "message": "\"Hi po. Hindi po ako nag-aaral sa NDMU. Nag-aaral ako sa University of Mindanao pero nakatira ako sa Koronadal :) Gusto ko lang po mag HI sa crush na crush ko since high school kay MS. JYNA DRILON. Keep Smiling crush. Palagi kitang nakikita sa mall nung december. Sobrang cute niyo po lalo na po pag naka smile kayo at nakasuot ng simpleng damit  :) Kahit snobber ka sa chat crush pa rin kita HAHAHA. Sana pansinin mo na mga chat ko. God bless.\n\n#KHID", "id": "395931383856469_699009430215328"}, {"created_time": "2015-01-16T03:31:28+0000", "message": "\"Hello Dameans\n\nSinu nkaKita ng Reading Glasses (Black)? January  12, '15\n\nPlease pa-bigay lang sa DSA..\n\nThanks GODBLESS", "id": "395931383856469_699009346882003"}, {"created_time": "2015-01-16T03:31:21+0000", "message": "\"first year ko.\nsa subject nga sociology na culture shock gd ko kay pag exam nmon may ara 3 ka engrng students yata to cla nga before the exam nghmbl si maam nga kung sin.o mag cheat kwaon nya ang papel.. t kay nag iloganai mn cla tatlo kag nkita ni maam hmbl to ni maam hy \"\"pass the paper now!\"\" wla pagd nila gnpati gnlwat pgd ni maam. \"\"Now\"\" ang isa unfair kay wla xa nadakpan kaluoy lng ang duwa. SSG pagd ang isa nga wla ndakpan.\n\n#kpopFan", "id": "395931383856469_699009310215340"}, {"created_time": "2015-01-16T03:30:59+0000", "message": "\"I recently had a vacation in the Philippines for Christmas holidays and I was eating with my mom and dad in Mc Donalds when I heard 2 ladies wearing nice clothes chitchatting about the other family who were very happy eating next to our table. The family looked so simple and innocent; very bold about what they felt in that moment but it was also obvious that they are not a well-off family. I can't really remember the exact words they used to describe them but they happened to say something that hurt me while I overheard what they said (because it's so audible). \n\nThe conversation went this way:\n\nGirl 1: Tan-awa bala ng pamilya dira nga gakaon o, daw mga manol, gapalak gid sila. Ahaw, Mc Do lang gid pro.\nGirl 2: Gani. Tan.awa bala ng ila mga bayo oh, tulokon ko palang baho2 na. Tani sa Mcduko-duko nalang na sila. Makadula gana.\nGirl 1: Tani magka Mc Do na sunod sa NDMU ah, para nami lang nga mga tao makita ta.\nGirl 2: Tama ka gid girl. Tani e lugar mana nila ila sarili kung diin sila magkaon. Sabad2 pagid ila mga bata daw wala nakapaligo.\n\nWell, it really hurt me because I really saw how happy the family was and maybe it was such a great day for them that they took themselves for a treat. I am also a nursing graduate at NDMU and currently working in Toronto. In Canada, McDo is not only for rich diners. People from all walks of life eat there. I am just sad because young people today are becoming more rude and don't value respect anymore. It doesn't matter whatever your status in life as long as you don't harm other people. I hope that this confession would reach the two ladies - Girls, you're both beautiful and has the potential to become successful but always remember that life doesn't come easy. You would understand more what I am saying now if you're out to the real world and battling all the challenges in life. You don't know the journey of the family; eating in McDo might be common for you but for them it's already grand.\n\nI talked to mom and dad that night and I decided to be a blessing to the family. I happened to have kirkland vitamins in my bag and I gave it for their children and I gave them small amount of money. Dad gave his leather jacket to the father and my mom gave her perfume to the mother. I was really touched when they hugged us as they say 'salamat ma'am, sir'. Well, I wish I could give more but at least, it added some glow to their yuletide season. \n\nNow, I am back here in Canada and while I write this, I am eating in Mcdo, enjoying my big mac, savoring my promotion as the new head nurse of my department. Let's always have that spirit of giving and loving, God will richly bless us more.\n\nHappy new year!\"", "id": "395931383856469_699009193548685"}, {"created_time": "2015-01-16T03:29:50+0000", "message": "\"Hello Admin  pwede pakipost?\n\nThere’s nothing wrong to admire someone because it is just a way to be inspired everyday :)))))\nHi to M.s Quennie Marie Zuyco :-D  I  been admiring you since then,  hope someday we can be friends? ^_^   take care      stay pretty and friendly always!!!\n\nI’m wearing the same color of shirt as you today :D\n#white <3\n#herSmiele", "id": "395931383856469_699008893548715"}, {"created_time": "2015-01-16T03:28:30+0000", "message": "\"permission to post po admin...\n\nnami2x na gid tana ang atubangan sang NDMU (main gate)..\n\npero na.realize ko nga hindi lang gali main gate ang gin himo nila...\n\nnag himo man gali sila ang round ball.................\n\nhamak mo, pagsulod mo, kinanglan mo pa mag libot sa pihak nga gate nga layo2x para lang makagwa?  \n\nmay ara man gate sa tupad sang entrance? gina sirad.an lang  ano ang logic sang skul ta man?\n\n-CET.MILES28.PANTUA-BOY.", "id": "395931383856469_699008506882087"}, {"created_time": "2015-01-16T03:28:11+0000", "message": "\"Oy. Meron kaming kakilala. \"\"Teacher's Pet\"\" kung tawagin ng iba. Classmate pa naman namin siya. Marami naman siyang friends pero ewan ba namin bakit dikit siya ng dikit sa mga teachers. Ewan namin bakit ganon siya. Para ba papasahin siya? or kulang lang talaga siya sa kalinga at sa mga teachers niya nahahanap? Nakaka bother lang talaga kasi anytime and anywhere kasama niya yung teacher na always niyang kasama ngayon. Yung iba nga sinasabi na \"\"sipsip\"\" siya. Parang nagiging buntot na kasi siya ng mga teachers na kasama niya and lately nakita namin sa facebook na may picture sila ng bagong teacher na kasa-kasama niya mukhang sa bahay pa ni maam. So nag effort talaga siya? Future teacher pa naman din siya. Anong help pwedeng gawin sakanya?\n\nMisisNiKanorNaMerongApelyedoNaSerendipity\nKolehiyo ng Mayayaman", "id": "395931383856469_699008423548762"}, {"created_time": "2015-01-16T03:27:48+0000", "message": "\"Daw palangga ko pa siya na daw hindi. Hindi ko maintindihan kung \"\"ego\"\" o \"\"pride\"\" ning gapugong sakun para balikan siya o hindi na gid ko sa iya. Nasakit na bi namon ang isa't isa. Lalo na siya grabe na gid sakit na nahatag ko sa iya. Hindi ko bal.an kay daw naluoy lang ko may feelings pa ko. Bal.an ko man trying hard siya magpakunwari na naka move on na. Pero ako ari daw nagasisi pero daw hindi ko man maamin kay daw gitapakan ko lang ang gipanghambal ko na hindi na gid ko sa iya. Daw gusto ko siya pero budlay i explain. Ano ni himuon ko man? \n\n-Egobuster", "id": "395931383856469_699008313548773"}, {"created_time": "2015-01-16T03:27:32+0000", "message": "\"\"\"Alam sa academics bugo sa love\"\" \nNing statement na ini dugay na gid ni ba pero tuod nga ba? Defend your answers.  \n\n-BSBAfreshie\"", "id": "395931383856469_699008236882114"}, {"created_time": "2015-01-16T03:27:20+0000", "message": "\"\"\"Pag ang babae gin*go mo sigurado kamumuhian ka.\nPero pag nakakita ka ng ginago na eh nagmahal pa pwede mong sabihing tanga pero yan talagang nagmamahal ng totoo't sobra.\nKaya sa susunod wag kang magtaka na pag nanghinayang ka na eh may iba nang nagpapahalaga sa kaniya. \nAt doon mo lang mararamdaman na sinayang mo siya.\"\"\n\nKaya sa'yo alam kong nagbabasa ka rito. Goodluck sa'yo. Malapit na graduation niyo. Alam kong ang gago ko. Sinayang ko yung pagmamahal mo kasi sabi ko hindi ka kawalan. Inaamin ko kinain ko yung sinabi kong yun. nagsisisi ako. Ngayon na masaya ka na sa kaniya ako itong nagdurusa. Sorry kung naipagpalit kita nung una. Ilang taon ko pa bago naramdaman na ikaw pala. Sana nakinig ako at di nabulag sa kaniya. Panandaliang saya lang pala yung sa kaniya. Dahil doon nawala ka. Sorry talaga. \n\n-Mr.Architect mula labas(JJ)\"", "id": "395931383856469_699008146882123"}, {"created_time": "2015-01-16T03:27:07+0000", "message": "\"Hi pala sa girl who said \"\"Hi James\"\" to me, which I am not, ( HAHA) during the Batch Reunion last December 27th. Hahaha. Ang cute po nung reaction mo ^^\n\nMrGoLucky :)", "id": "395931383856469_699008080215463"}, {"created_time": "2015-01-16T03:26:57+0000", "message": "\"Hi! Ano po ba ang may 2 years course sa NDMU? \n\n-Anony", "id": "395931383856469_699008036882134"}, {"created_time": "2015-01-16T03:26:39+0000", "message": "Annyeong! Sin-o nakakilala sa dance group nga Blackout/The Generalz nga mga taga NDDU? :) Especially sa mga Kpop fans :D\n\n-Anonymous", "id": "395931383856469_699007993548805"}, {"created_time": "2015-01-16T03:25:40+0000", "message": "\"Happy new year dameans. Sana happy din tayo sa grades. Hahaha\n\n- c", "id": "395931383856469_699007796882158"}, {"created_time": "2015-01-16T03:24:18+0000", "message": "Papost. \nKung sino da gahampang clash of clans, JOIN kmo samon nga clan. Puro dameans lng. Name sang clan. eN Di eM yU \nSalamat :) pakilala lang kamo\n\n-Anonymous", "id": "395931383856469_699007463548858"}, {"created_time": "2015-01-16T03:23:47+0000", "message": "Hello SUSHI. ( because i don't know your full name )\nI'M Carl of BUSINESS\nyou really got my heart when THE FIRST TIME i saw you in the school ( NDMU ). \ni dont know why i'm feeling this way.How can I get closer to you? I'm too shy to talk to you, so right now it feels safer to watch you from afar and not be rejected. You have a place in my mind.you may be surprised, because this is the only way to express my secret love for you. Please, when you read this, mail me back, so I will know how you feel.\n\nHELP ME FIND THIS GIRL.\n#4thyear", "id": "395931383856469_699007363548868"}, {"created_time": "2014-12-30T05:37:50+0000", "message": "\"Hello! Kamusta ang holiday niyo? Sa sobra kadamo sang handaan nga ginkadtuan ko. Makamiss ang really good food sang Food of D' Day sa pantua a. Nagaagree gid ko kay Samantha. Barato kag manamit gid iya. Kaon ta didto guys pag balik klase ha?\n\nPizzalet,HRM,20\"", "id": "395931383856469_688340874615517"}, {"created_time": "2014-12-30T05:35:52+0000", "message": "\"Hi po, :). Pki post na lng.,Thanks!\nHi gali kay Ms. Thalia Joyce Nakanishi sng Psychology 2nd year. You inspired me a lot in my studies. Continue to inpire other people. Thanks ;)\n\n~ UNIVERSITY HUNTER", "id": "395931383856469_688340451282226"}, {"created_time": "2014-12-30T05:35:37+0000", "message": "\"*PLEASE POST ADMIN\n\ni just want to say HI to anton gesulga from CHS. ngayon alam ko na name mo. i have the chance to know you better. I sent you a message through FB, everytime na nag oonline ako palagi kng ini open timeline mo if na accept mo na friend request ko. kahit messages ko sau .. pero last time i check. kahit ngaun hndi mo pa din nababasa. taz naka private account mo. :( hoping mabasa mo na . and I already send you my phone number. baka maisipan mong itxt ko. \n\n#antongesulga\n#CED<3CHS", "id": "395931383856469_688340411282230"}, {"created_time": "2014-12-30T05:35:13+0000", "message": "\"CRUSH?! Okay lang naman na may Crush ka normal lang yan kasi sila nag bo-boost ng heart at mind mo sa school. huehuehehe! :3\n\nHi! Dugay nako wala naka confess ba. Gusto ko lang ei-share about sa akon nga crush. Taga CET siya ma describe ko sa iya CUTE kag nami siya mag SMILE. SMILE nalang siya permi bi. Actually nag start ang pagka crush ko sa iya tung second year second sem ko habang gumaganap yung P.E class nila sa Volleyball. Cute kasi siya ah! Hindi man kami close naga Smile lang kami sa each other kapag magkita kami hangtod didto lang asta nga nag abot ang thirdyear ko nag close kami as in close.. Updanay kami maglagaw kag kaon and marami pa. Then sa pagka atat ko na sugid ko sa iya ang akon nga naramdaman Na-shock ko na alam niya na pala dati pa! Asta didto nag more close kami nag abot ako sa time nga nag hambal ko nga MAHAL KO SIYA pero di siya maka hambal kay love niya pa yung EX niya. Nag gawa ako sang paraan kung paano ko siya mapa-fall sa akon tanan ging himo ko tanan ging sacrifice ko para sa iya. Asta nga na shock ako after pila ka weeks ging hambalan niya na ako na MAHAL NIYA NA DAW AKO WAAAAAAH! Then si Ante ninyo nag \"\"ASA\"\" man nga basi magkalovelife na. Tapos weeks passed bigla nga wala na daw naga fade na daw ayaw niya sa akin. T_T huhuhu Feel ko may iba na siya gina landi or sadyang ayaw niya lang talaga sa akin.\n\nAno himuon ko? Pagpatuloy ko ni kag mag-asa nga basi magustuhan niya man ko kag palangga-on niya ko OR ma-stop nako kay masakitan lang ko kay basi trip niya lang ko. Hindi ko bi ma-gets kung ano gid bala kami. :\\\n\n- KOLEHIYALA :P\"", "id": "395931383856469_688340331282238"}, {"created_time": "2014-12-30T05:34:16+0000", "message": "\"To those people out there who thinks they will never be able to move on guys time will come you will. But if you don't think you can you will never be able to. It is not easy and it takes time but moving on is for your own sake. Who wants to be stuck with the past anyway right? We must keep moving forward. So if he or she cheated on you or just played? Just move on improve yourself and the day will come that the person who have hurt you will finally say \"\"d*mn I shouldn't have done that\"\" he or she will eventually regret the things he or she have put you into. He or she might not admit it but deep inside the people of have hurt you will regret. But this will not happen if you will not move on. Be happy be a better version of your yesterday. Just let karma f*ck those people. \n\n-blueladyeagles", "id": "395931383856469_688340071282264"}, {"created_time": "2014-12-30T05:32:31+0000", "message": "Para sa dati kong #CRUSH, salamat sa experience.  (Kilig Feeling! Hello!!! Goodluck to your Souls) Hindi mo man nalaman, kinikilig ako sayo. Tumatambling puso ko pag nakikita ka. Tapos kapag nagtatagpo yung mga mata natin, (waits lang, CRUSH mo din kaya ako???) solb na ang araw ko kahit na 16/70 ang quiz result ko sa ******** Problems. Ala lang. Baka kasi mafeel mo na okaw to. Eh di happy ka!  #NDMUMOMENTS", "id": "395931383856469_688339611282310"}, {"created_time": "2014-12-30T05:32:10+0000", "message": "Ako gali ang author sang post nga ginpauntat sang tatay ko. Salamat sa pagpakita niyo sang concerns sa akon. Dira ko gid nafeel nga may mga tao pa gali nga nagacare sa akon. Btw, sa nagcomment nga mag gia ko, selective bi na ang guidance sa mga course nga pwede nila ipa sulod sa gia. Unfortunately, di pwede ang course ko kay mahal mahal ni. Kag gamay gamay lang gakuha sini. Ayoko naman po sanang isuko ang course ko kasi nakikita ko na ang sarili ko na nagtatrabaho na ganito 3 years from now. I also planned to seek for scholarships but wala ako sa timing palage, palagi pong late na. I also went to guidance and asked available scholarship but they say wala na po. I felt so helpless na parang wala nakong option. Pero ganun talaga ang buhay, i have to accept it.", "id": "395931383856469_688339541282317"}, {"created_time": "2014-12-20T21:02:37+0000", "message": "\"Hi. Please allow me to post this ad as we are in need of interested applicants to teach English in Thailand in May next year.\n\nQualifications:\n\n1. Bachelor's degree holder of any discipline not necessarily Education graduate.\n2. Excellent in English both in oral and written.\n3. Willing to teach in provinces outside Bangkok.\n4. Willing to attend a 2-day seminar-workshop in Nonthaburi, Thailand.\n5. Willing to take the Test of English for International Communication and must obtain at least 800 average score.\n\nBenefits:\n1. 21,000 baht/month salary\n2. 12-month salary\n3. Paid 3-week vacation (October or March)\n4. Visa and work permit assistance\n5. Medical Insurance every year\n\nIf you're interested, please submit your CV with recent photographs to maiecou@yahoo.com CC to joronargleen@gmail.com. When you see this ad and you applied please write NDMU-AD:(YOUR NAME) as the subject of your application. Short-listed applicants will be contacted for interview. Thank you and God speed your ways.\n\nPosted by: \nJO RONAR GLEEN CABOTE BARILLO,RN\nBACHELOR OF SCIENCE IN NURSING, L'EXEMPLE DE SOIN 2011\"", "id": "395931383856469_682249481891323"}, {"created_time": "2014-12-20T21:01:12+0000", "message": "\"hello po\npaki post po admin :))\ncrush na crush ko po talaga si one and only Valerie Domingo \n:)) she's my biggest inspiration :)) sana mapansin mo ako \n#JRC\n#Jabir", "id": "395931383856469_682249161891355"}, {"created_time": "2014-12-20T21:01:03+0000", "message": "\"Sa nahalata ko halos tanan nga products sang siena nga sa ndmu gaeskwela mga gwapa. Miss ndmu 2013 kag 2014 taga siena daw. Way lang. Gashare lang ko sang thoughts ko. \n\nObserver", "id": "395931383856469_682249121891359"}, {"created_time": "2014-12-20T21:00:50+0000", "message": "\"Hi Joan Celino Reyes. Floodliked your photos as of Dec. 15, incase you want a clue of my identity. Been noticing you at the campus lately. Wanted to let you know that I admire you. Keep wearing that vibrant smile.\n\n- Gee", "id": "395931383856469_682249065224698"}, {"created_time": "2014-12-20T21:00:14+0000", "message": "\"\"\"it's only natural for a girl you're crushing on to be in love with somebody else,\nsince you're in love with her,\nshe sparkles in your eyes.\nthat's why people fall so irrationally in love.\"\"\n-Watari(Shigatsu wa Kimi no Uso)\n\n#torpe", "id": "395931383856469_682248921891379"}, {"created_time": "2014-12-20T20:59:11+0000", "message": "\"PAKI POST LANG ADMIN! \n\nSA MGA KA ATHLETE KO DA! \n\nANO MA HAMBAL NYO SA SISTEMA SANG ATHLETICS TA??????????\n\n-PRISAA2014-", "id": "395931383856469_682248691891402"}, {"created_time": "2014-12-20T20:58:15+0000", "message": "\"*paki post please :)\n\nano pangalan ng lalaki na representative sa duet nung NIGHT OF MUSIC ng CHS nung U-WEEK! wanna know him better :) i think he's nice and i like him :)\n\n#he'smineImHis", "id": "395931383856469_682248435224761"}, {"created_time": "2014-12-20T20:58:01+0000", "message": "\"admin paki post po please\n\nANO TONG FOUNTAIN SA MAY NEW BUILDING MN ?\nWISHING WELL BA TO KAY MAY NAKITA KO NGA \nMGA PISO, KUNDI NAMULOT KO KAG NAG PAPRINT\nSA PISO PRINT HAHAHAHAHA :D\n\n---\nULO NI RIZAL", "id": "395931383856469_682248348558103"}, {"created_time": "2014-12-20T20:57:47+0000", "message": "KUNG SINO MAN ANG NKAKITA SANG WALLET NGA ART WORK COLOR RED PLEASE PKI BALIK LANG BISAN ANG DRIVERS LICENSE KO LANG MAY PANGALAN MN TO PKI ULI NA LANG SA CBA OFFICE. THANK YOU", "id": "395931383856469_682248308558107"}, {"created_time": "2014-12-20T20:57:41+0000", "message": "\"HI!\nI JUST WANT TO SAY HI TO, SA TANGKAD BALA NA MEMBER SA SAINT CECILIAS CHOIR ATONG PIRMI GA BEATBOX, KUNG GIS.A NAKA YELLOW OR GREEN NA UNIFORM. ANO NAME NIYA? \n\nNA ATTRACT BI KO SA IYA, PWEDE AKON KA NA LANG. CHOS!\n\n@@@JPE@@@", "id": "395931383856469_682248275224777"}, {"created_time": "2014-12-20T20:57:26+0000", "message": "\"Hi Dameans! May i-share lang gali ko nga bag-o nga snack house sa pantua. FOOD OF D' DAY ang name. Didto kami pirmi gatambay sang friends ko kay namit gid ila foods lalo na ang carbonara kag burger. Sulit gid inyo kwarta.\n\n-Samantha, 17, BSBA", "id": "395931383856469_682248185224786"}, {"created_time": "2014-12-20T20:56:54+0000", "message": "\"\nADMIN PAKI POST. THANK YOU!\n\nDECEMBER NAMAN! MERRY CHRISTMAS SA TANAN IN ADVANCE. \n\n:-*:-*\nHello gali kay Aljin Gabiosa sang CET. \nGusto ko lang magparegards sa imo. \nDaw arabo kagid ba. \n\n<3 <3\n\n-qwertyboy", "id": "395931383856469_682247948558143"}, {"created_time": "2014-12-20T20:56:45+0000", "message": "\"Yung totoo ngaa gabayad kita sang 100PHP for OMIANA every sem sunod asta subong wala lang gihapon. Dapat gani dalawa na ka issue plus tendrils pa. Kag dapat nami ang quality. WHUT HAPPENED? \n\nmangkot lang jukin.\n\n>anaconda", "id": "395931383856469_682247895224815"}, {"created_time": "2014-12-20T20:56:25+0000", "message": "\"Hi Admins and readers\n\nI seldom admire someone specially my opposite gender but right now I’m having a weird admiration to a guy.  We always talk a lot before using some world technology. There is always a way that I could talk to him but I prefer not too since it will make me a desperate girl chasing a guy.  I miss those conversations and weird topics that we had. I miss his deep thoughts and jokes. Although I know that I like him but I can’t move and say hey! I like you. I’m always afraid that the society will judge me and mistaken me as a slut since the ideal view says that girls should not do the first move. If a girl show or confess to a guy that she like him is that really a turn off? Does it made her cheap?\n\n-LifePlease", "id": "395931383856469_682247811891490"}, {"created_time": "2014-12-20T20:55:36+0000", "message": "\"For the judgmental people out there*\n\nMeron ba kayong mga kaklase na big deal ang word na \"\"VIRGINITY\"\" and \"\"VIRGIN\"\". Meron kasi akong kaklase hindi lang siya magisa kundi marami sila. Ewan ko kung may pagkamaniac lang sila o di kaya masyado silang concious. One time meron silang napagtripan, medyo chubby yung girl. sabi pa ng isa dati hindi yan mataba ngayon nagkaboyfriend lang tumaba na then others follow up said the word \"\"ALAM NA\"\". And then It was happened again na andyan ako pinaguusapan nila yung sexy kong kaklase na babae. Yung babae malaman(katamtaman ang katawan, hindi mataba hindi din payat) malaki yung pwet, may shape ang baywang at medyo malaki ang boobs parang 32B, malaki legs. May bf yung kaklase namin parang bago lang sila. Nagalibog gid sila kung virgin pa daw ang babae, ginlantaw nila kung baka. Hindi man gid daw. Kilala sang upod nila ang babae amo gid daw na lawas sang babae dati pa tong high school. Kaurogot pagid sila kay may ara sila isa ka medyo close ko nga babae ginabastos nila, like hambal nila \"\"naano na na sya ka migo nya\"\" asta nagabot na sa daw ginaforce na nila nga mag amin. Naluoy ko sa friend ko. Sa naobserve ko sa friend ko bigla sya nahuya kag na speechless sa mga boys gapamangkot sa iya. Subong nahuya na sya makipagsocialize na sa iban, daw guilty sya kay naapektuhan gid abi sya.\n\nBasi may ara da mga amo nga mga lalaki, tani hindi kamo mag inamo sina. Dapat ginarespeto nyo ang tanan nga mga babae. We dont have right to judge others kag mangialam sa ila. Respeto lang gid tani, gapakita abi kamo nga hindi kamo tuod nga lalaki.  Dapat gentleman kamo, dapat protektahan nyo ang mga babae biskan hindi nyo kilala. Hindi nyo bal-an kung ngaa nahatag nya to, everything happened for a many reason. Waay gali ko ga command nga dapat amo kamu sina, kalain abi amona batasan nyo. Okay lang magjudge wag lang pasobrahan at sana wag kayo gagawa ng mga bagay na ikakasakit ng iba.\n\nSa mga lalaking katulad nila ito tandaan nyo: Having a hymen and being a virgin are not the same thing. There are other ways that a hymen can be stretched open, by inserting something into the vagina (like a tampon or a finger) riding a bicycle, or doing sports. And some girls are born with so little hymenal tissue that it seems like it was never there. Ano ng hymen? is a thin, fleshy tissue that stretches across part of the opening of the vagina.\n\nGoodluck sa imo boy tani kapangita ka asawa mo nga virgin pa kay amo ka sina ka concious!\n\n-minie", "id": "395931383856469_682247605224844"}, {"created_time": "2014-12-20T20:52:20+0000", "message": "i am a student in ndmu. nami tani magstudy subong nga gab i (dec. 12, 2014) kay lapit nalang ang hellweek naton. pero samtang ginaisip ko nga nagapanami bala ko sang performance ko , mga taas nga scores kag good recitation, daw nasayang lang kay my parent/financial provider told me kaninang umaga na di nako mag eexam. naprolong lang ang agony . tani ginpauntat niya nalang ko this sem para bal an ko na dayon, hindi nga biglaon niya tanan tanan. that was very traumatic, maka dula gana. nagtinguha pa ko mag dean's list last sem but my efforts were wasted. \nkaya sa mga di nag aaral ng maayos diyan, swerte lang kayo na may magulang kayong nagpapakamagulang\n\ngoodbye. NDMU. \nGOodbye schoolmates.\n;(", "id": "395931383856469_682246838558254"}, {"created_time": "2014-11-28T21:24:59+0000", "message": "There are people who judge us once they see us in an NDMU uniform. Just because we study in an institution that is not prestigious enough for your liking does not make us any less human. Quit being hypercritical and focus on your studies and your personal life lovelies. Our business isn't your business. We study to graduate, not to gain a social status that is just temporary. Pray hard. Study hard. And of course, eat hard. Love love love :)\n\n-Anonymous", "id": "395931383856469_671031093013162"}, {"created_time": "2014-11-28T21:24:25+0000", "message": "\"I've been studying in this institution for 4 years and has been in the same club ever since pero ngayon lang talaga nagkaroon ng officers sa club namin na medyo wala klaro. EG: Team Building was held days before the exam na diba dapat a week before the exams wala ng events or whatever? And...We've had this meeting about our shirt-on what color we'd be having for this year and the price last semester. The color voted by the majority and won was pink and the price daw ay dapat di mabigat sa bulsa. And the color of the design posted in our bulletin board is blue with black and white sleeves. And it costs 300 daw. So nagpameetin pa tayo noh? Hehe. Sana di nlng nag meeting kung di din susundin. #JustSaying\n\n-C.K.English", "id": "395931383856469_671030923013179"}, {"created_time": "2014-11-28T21:24:09+0000", "message": "\"PLEASE POS THIS! \n\nHELLO DAMEANS!\n\nGapanawagan ko sa mga Estudyante sang NDMU..kong sin o man nakakita sang Cellphone nga -  cherry moblie (amethis), pink flip cover, white back cover..\nkaginang aga lng gd nadula sa may gym banda..around 8am-10am (nov. 24, 2014)..\nSALAMAT GID KAAYO KONG SINO MAN ANG MAKABALIK..KAG KONG SIN O MAN ANG NAKAKITA..BAL AN KO BUOT2X KA GID NGA ESTUDYANTE! \n\nPLEEEEEAAASSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSE! :( PAKI DEPOSIT NALNG SA DSA KONG SIN O MAN ANG NAKAKITA..\n\nMADAMO GD NGA SALAMAT...\n\n#HOPING! T.T", "id": "395931383856469_671030833013188"}, {"created_time": "2014-11-28T21:23:51+0000", "message": "\"Hi gali sa babae nga pution sa gamestation sa pantua kag.ina. 5pm ata sya nag out. nov 24,2014 to be exact :D\n\n-new student", "id": "395931383856469_671030739679864"}, {"created_time": "2014-11-28T21:23:37+0000", "message": "\"BUONG PUSO  KUNG TATANGGAPIN ANG MGA KRITISISMO!!! char :*\nWe all have our own preferences and beliefs , it could either be in terms of RELIGION(maybe you already have a hint on what this topic would be all about),music,movie, or maybe even on what our friends hair should look like. As I was scanning the channels on tv looking for something to watch, I happened to stop on the INC CHANNEL(Iglesia Ni Cristo channel). I was in awe of what I saw, a woman kneeling and praying in front of the altar with statues of Jesus and saints. At first, I thought it was a good thing as a Catholic being featured on the INC CHANNEL despite our religious differences, but I was wrong. After which, they were asking questions saying why do we Catholics worship the statues even if it was written in the bible that we should not worship idols. Then it became lucid to me that they are questioning my religion. People still make this silly claim that we Catholics worship the statues because we have them in our churches, and by that, there now goes the accusation that we are violating God's commandment: \"\"You shall not make for yourself a graven image or any likeness of anything that is in heaven above, or that is in the earth beneath, or that is in the water under the earth: you shall not bow down to them or serve them\"\". Once and for all, we Catholics do not worship in any way the statues in our churches. We only use statues,paintings and other devices in the form of art to recall the person or thing being depicted. In the context of kneeling/bowing in front of the statues of Jesus and the saints especially when we are praying does not necessarily mean that we worship them. Bowing/kneeling can be a form of greeting, you can even bow in front of a king by not worshipping him. In my humble opinion, there is no problem in making someone believe in what you assume is right and true, only if it is for the greater good of everybody and no one or nothing will suffer during the process.\nP.S. I have nothing against the religious order being mentioned :D I just want to clear everything, and WOULDN'T IT BE A BETTER WORLD IF WE ALL BELIEVE IN ONE THING? THAT IS WE ARE ONE DESPITE OUR RELIGIOUS DIFFERENCES!!!!\"\n\n-Anonymous", "id": "395931383856469_671030683013203"}, {"created_time": "2014-11-28T21:21:25+0000", "message": "\"Nga a wala gina balik sang naga kaun sa may canteen ang ila eating utensils haw? Naga mayan ba sila mag basa sang signage o damu nagid maid sa marbel amu na sanay sila nga may ga himus sang lamesa nila sa ila balay? Kalain abi mag kaun nga may mga baso,kutsara,pinggan, etc. sa lamesa ah, daw sa dumpsite takun ga kaun yah... \n\n-GreenMinded", "id": "395931383856469_671030163013255"}, {"created_time": "2014-11-28T21:20:22+0000", "message": "\"Papost admin.\n\nHi gali sa medtech na gnajudge sang kadamuan. I hope you're doing fine. Been there abi, nang malakat ka bisan diin may mga mata nga gasiga kag baba nga ga putak. Bisan hambalun na ndi pag pansinon daw ndi gid maiwasan. Don't worry, bisan sguro 3/4 ang gajudge saimo subong, at least may 1/4 na naintindihan ka. Damu bi narrow-minded subong eh. Go lang sa life ah.\n\n-avid reader", "id": "395931383856469_671029889679949"}, {"created_time": "2014-11-28T21:19:40+0000", "message": "I'm an alumni of NDMU. This is my first time to post here. I am just so concerned about that issue with the medtech and GIA. And if I were the parent of that GIA and witness his/her co-marist student degrade him/her like that I will definitely feel bad because it seems like it was my fault that my son/daughter was put into that situation. That anybody can step on him/her becoz of the status in life. I will really feel bad that my child needs to work for her to study in a good school becoz I can't provide a full financial support to his/her education. And to be honest, I am a GIA before way back year 1998 in NDMU. My parents don't want me to work while studying because my course is not that easy but I have no other options and I know they feel bad about it. I am now an engineer,happily married with 1 lovely daughter studying in UP diliman and she is also a working student there at the age of 16. Independent at a very young age.I am a proud parent  becoz we can actually support her financially but she insist to work in UP. The reason why I am posting this is to let everyone realize na bilog ang mundo. You might be on top now, but you'll never know when are u going down. . And those at the bottom has no other way but to go up. In short, we are all equal. Wala mayaman, wala mahrap. And the most important thng is, RESPECT to one another.\n\n-Anonymous", "id": "395931383856469_671029649679973"}, {"created_time": "2014-11-28T21:17:59+0000", "message": "\"admin pki post..ty\n\ntani ibalik sng nakakita sng notebook ko nga camella. nabilin ko sa creegan 8 kahapon after sng rizal namon ke ma'am Porras. daku gd pasalamt ko kng mabalik mu to, ara gd b tanan ko nga gecopy sa tanan nga subjects, please...... may name man ang mga papel nga nka insert dd2. thanks...\n\n~4th year psyc.student\"", "id": "395931383856469_671029103013361"}, {"created_time": "2014-11-28T21:13:47+0000", "message": "Buot tana ng mga Medtech ya, HONESTO PROMISE!\n\n- DyeyDee", "id": "395931383856469_671027919680146"}, {"created_time": "2014-11-28T21:13:24+0000", "message": "please, pakipost\n\nsa tanan gali gagamit sang laboratory 4th floor sang omer, please hindi magdinamak ha kay may iban nga mapasal an sa mga higko nga ginabilin niyo pirmi didto.\nhindi niyo pag irason nga mahal tuition niyo kay parepareha lang ta. \n\n#yabang", "id": "395931383856469_671027833013488"}, {"created_time": "2014-11-28T21:13:03+0000", "message": "ADMIN pls pkipost.\n\nMaristas please tani hindi na nton iopen pa ang amu na nga topic para di na mglala.Kag tani hindi naton iblame ang both parties kay tnan ndamay kung mabal an ng GIA sya or Medtech.Everyone Deserves a second chance and tani PEACE na lng.Ayon nga sa kanta: \"Maliit na butas lumalaki,konting gusot dumadami...maraming namamatay s amaling akala,ohyeah!Christmas season namn diba so why don't we give LOVE on Christmas Day.<3<3<3\n\nThanks!\n#CherVin", "id": "395931383856469_671027723013499"}, {"created_time": "2014-11-21T20:49:48+0000", "message": "\"Please Post This\n\n   Crush ko po si Valerie Mallare Domingo. Hindi ako umaasang mapapansin mo ako pero gusto ko lang sabihing ikaw ang inspirasyon ko.\n\n- ^_^ -", "id": "395931383856469_667277350055203"}, {"created_time": "2014-11-21T20:49:40+0000", "message": "\"hi po admin. :)\n\ntanong ko lang po??????????\n\nwala pa lge may lumalabas na issue ng OMNIANA??\ntapos every pay day (enrollment and sa statement of accounts ) nagabayad kmi para sa omniana. \n\nlast years kay once lang kmi makarecieve ng issue.\ntapos  every sem kmi nagabayad. \n\n#simple guy14!!", "id": "395931383856469_667277266721878"}, {"created_time": "2014-11-21T20:49:27+0000", "message": "\"sana po i-post nyo..\n\nDidto bala sa issue nga Med-Tech and GIA misundertsanding. Grabe gid bala kamo maka judge kay ate nga Med-Tech, hnd nyo man sxa kilala para maghambal kamo sina. Kag para kay ate GIA, tani aveh hnd ka magsinuplada kag sa iban aveh nga GIA, biskan pamangkuton mo sang tarung kalain gid aveh sila magsabat. May ara man ko sang mga ate kag kua nga GIA pero hindi man sila amo sina buot-buot pa gani sila. Nanotice ko pa gid aveh, since nag start ng issue nga na, damu gid ko mabatian nga gahikay sa mga Med-Techs, kung makahambal sila nga wala kami batasan daw kilala nila kami. Hindi nyo man tani kami pag-i judge according lang sa nabatian nyo kag sa mga chismis. Gina lahat nyo gid aveh ang mga Med-Techs, kag kalain gid sila manulok once mabal'an nila nga Med-Techs kami..\n\nRESPETO LANG BEH!\n\n-ms. piggy", "id": "395931383856469_667277186721886"}, {"created_time": "2014-11-21T20:49:03+0000", "message": "\"ang MISSING COUCHES sa new building, kaya ko pa idefend.. pero ang WiFi?? pra sa mga bisita lang pala yun ?? NASAAN ANG KATARUNGAN ?? gabayad ta trong pay. dako2 pgd ang tuition.. haaaaaaaaayyy\n\n-Jay Malinis", "id": "395931383856469_667277083388563"}, {"created_time": "2014-11-21T20:48:45+0000", "message": "I just have something to tell to those students who are simply stereotyping people especially in our school in which some of them are judging by course. Isn't it a bias? Just because that person had committed mistakes and came from that course doesn't mean that all students from that course are like that. Remember that the attitude of only one person present in the batch doesn't necessarily mean that all of them have that kind of attitude. Yes, I'm a MedTech student and I just hate to think that students in our school who can see NDMU MedTech students anywhere inside or outside the campus might immediately have in the back of their minds that MedTech students have bad attitudes. I hope all of those who are really bashing US will realize that. And I hope that, that GIA and MedTech student will ask forgiveness to each other and just forget what had happened since they both learned their lesson and not to do it again.\n\n-Anonymous", "id": "395931383856469_667277023388569"}, {"created_time": "2014-11-21T20:47:56+0000", "message": "\"Sa Tuod lng bala makahurt ang mga comments nyo guys ..please hinay2 lng..about ni tung s medtech-gia...if you will try to consider both parties, misunderstanding lng ang tanan...isipon ta man tani Kung makahelp s situation ang mga gnacomment ta..oo, freedom wall ni sya kag comment all you want ni sya pero isipa nyo man ang mga gnacomment nyo..wla kamo karapatan mang judge sang tao Kay Hindi kamo ang nakaencounter s iya...daw s klase lng na abi, Hindi magsaligbat Kung hnd mo bal.an o hnd ka sure sa imo nga Sabat..Hindi ka magsinali Kung hnd mo bal.an ang Tuod nga natabo...KiLALA ko both ang MEDTECH kag ang GIA kag misunderstanding gd ang natabo..so please don't judge! For sure nahimo gd ni move ang isa s ila para maayos ni..hnd na tani mag intra2 ang wala man lng maibulig..\n\n#damean", "id": "395931383856469_667276813388590"}, {"created_time": "2014-11-21T20:47:07+0000", "message": "\"Hello. Gusto ko man tani magshare sang akon nga observation sa GIAs sa library. Kung hapon na, pag maglampas na 5:30pm gaamat-amat na himos ang GIAs. Pero syempre kung kis-a di gid maiwasan maglampas na 5:30 nga ara gihapon ko sa library kag di pa natapos kastudy para tani sa next class namon. Ang napansin ko lang kay kung ginaarrange na nila ang chairs kag books, daw ginasadya gid nila bagsak kapin pa kung lapit na 6 tapos isa or tatlo na lang nga tao ang gabasa sa library. Kag ang iban gapabati2 pa nga damo pa sila ubrahon. Kis-a ginahambal ko na lang sa upod ko kung may ara man, \"\"Lakat na ta kay daw ginatabog na gid ta diri sa library\"\". Ok man lang tani kung palapitan ka na lang nila kag hambalan in a good way nga kailangan mo na maglakat kay mag close na ang library. Dati pa gid di ko kastudy mayad kay ang GIA sa 3rd floor gapamusic sa ila counter, ok lang man tani magpamusic as long as sila lang ang makabati kay library man to.\n\nWala man ko gapangaway. Gusto ko lang gid mag share.\n-LIBRARYDUDE", "id": "395931383856469_667276580055280"}, {"created_time": "2014-11-21T20:46:27+0000", "message": "\" Ano pangalan ni ate na \"\"eyoow GG\"\" ang ringtone? ... <3 perme2 sya ga smile :) classmatanay kami taga LUNES,MIYERKULES kag BIYERNES. 7:30 ged sng kaagahon ah. \n\nHello ganda! Tawa kalang palagi. Bagay sayo <3 \n\n#Stalkstalkstalk", "id": "395931383856469_667276496721955"}, {"created_time": "2014-11-21T20:46:07+0000", "message": "\"Diin na ang mga 4th year nursing students man?ayawan kmi katambay sang mga kaberks ko sa SLR makakita lang sang mga white ladies pero daw la nagid pag-asa haw?OJT na kmo?regards sa inyoh :-)) congrats mag graduate na kamo. Excited na ko magkasakit kag tani maski isa man lang sa inyo maging nars ng buhay ko..\n\n#SNSDnurses\n-troyVCba", "id": "395931383856469_667276400055298"}, {"created_time": "2014-11-21T20:45:42+0000", "message": "\"Hi. Gusto ko tani mag comment sa other angle sang story about satong GIA vs MedTech student. Gusto ko tani mag hatag ka opinyon ko sa gina hambal sang mga iban nga studyante sa NDMU nga \"\"Salig kay mahal iya tuition, daw si sin-o na!\"\" Actually, graduate nako. Nursing akon nakuha sa NDMU dati kag puno gid kami sang pamuyayaw sang una lalo na sa maestra namon nga dusngal sa RE kay kuno mahal amon tuition daw si ka tore na daw kami. Magahod kag mga bastos. Pero ang tuod na bisan gasorobra singkwenta mil amon tuition kada semester wala pa labot mga duty namon sa hospital, wala tana naga bag-o ya batasan namon ahh.. May iban guro nga mga kalainot gid batasan pero hindi tanan. siguro gahod kami sang una, tungod kay sabay2 kami mag break kay amon schedule tama ka lain sa iban nga courses.. Alangan, urupdanay kami tanan, 5 ka oras kami gapamati sa lecture sa isa lang ka subject nga kasurum-od, pag gawas namon ma hipos gyapon kami? \n\nNg, mga gahambal nga \"\"salig mahal iya tuition\"\" da, abi palihog lang open your mind! Tanhaga may mga barato lang man gani mga tuition nga naga skwela da sa NDMU, perti gani ka lapat batasan. Kag hindi kamo ma paranoid, kay wala namon gina simo2 ya tuition nyo kay kami mismo naga problema paano mabayaran amon MAHAL NGA TUITION!\n\n-DEP*TA!\"", "id": "395931383856469_667276236721981"}, {"created_time": "2014-11-21T20:44:03+0000", "message": "PKI post po..\n\nGus2 ko lng gli i voice out ang mahiwagang ID ng NDMU.. sa pagkamahal tas dali2 lng ma erase ang back portion..dw hndi worth it ang gin bayad tapus panu ma contact ang person in case of emergency kay erase na ang back portion,,kung amo man lng sina tani wla nlng nag required sang ID ky hindi na mabasa ang likod,,dati hindi fa man amu cni ang ID,,dw tibay fa man..tnx gd..\n\n#aCtion pLz:-(", "id": "395931383856469_667275776722027"}, {"created_time": "2014-11-21T20:43:18+0000", "message": "Admin pwede paki post man. Hahah. Na bother na bi ko about sa medtech issue. I'll speak for myself nalang. Hi guys! Medtech student man gali ko. For me kalain abi kay everytime maglakat ko upod sang mga classmates ko sa hallway feeling ko may mga leprosy tamon. Ang mga tao ginatulok gid kami kag maghutik2 kag magtinulukanay. Magkaon kami sa canteen the same man gyapon. Magsulod kami sa library the same scenario gyapon. Gina pabati-batian pa gid kami. Bal'an ko man nga mali gid in any way ang nahimo sang classmate ko pero hindi lang tani mag judge kay common sense would tell us na hindi niya man to mahambal kung wala gid may natabo. Alangan naman ma \"goodmorning\" lang ang GIA hambalan niya na gid dayon sang phrase nga to dbuh. So hindi man sa naga defend ko pero siguro try ta lang ei analyse ang mga bagay2 before magcomment. Kag be careful nalang sa mga nagapost kay biskan simply lang na nga post makaguba gid siya sa tao kag sa mga nakapalibot sa iya especially pag hindi whole story ang gin share mo. Thankie! XD \nP.S. para mabal'an niyo man ang feelings namon kag buot man kami ba gahod lang gid galing pero hindi man gid permi. Hahah. Aminin niyo man ga gahod man kamo dbuh. \n#bothered?LOL", "id": "395931383856469_667275450055393"}, {"created_time": "2014-11-17T14:41:16+0000", "message": "\"Hello Admin:\n\nHopefully ma post gid ni sya :)\n\nMay BF ko Graduating Student na sya from the College of Business Administration. FM sya guys. mag 4Months na kmi. tapus nag selos sya last week dahil kay nag post sa Wall ko ang ex ko kay dw natamaan gd dw sya sa mga Quotes ko. krun c BF seloso gd syempre di tman na ma deny dba, tnan man ta ga selos. After nya nabasa to wla na sya nag imik asta sbng nag one week na wla gd sya ga communicate. :( \n\nMag ask lang tni ko bulig kung anu ang dapat ko himuon para maging OKEY kami.\nThank you sa Positive response nyu guys.\n\n#katikhat", "id": "395931383856469_665229130260025"}, {"created_time": "2014-11-17T14:40:35+0000", "message": "\"Please post this admin as soon as possible\n\n   Sorry lang gd tong nabanggaan ko kagina 12 sang hapon sa netspot pantua banda. gapangayo lang gd ko sa imo sang sorry kag despensa. bal an ko sakit to sia, sa kamot pa gd. hayyzzz\n\n-Mr.WlaPROpanilag", "id": "395931383856469_665228893593382"}, {"created_time": "2014-11-17T14:40:09+0000", "message": "\"Hambal sang MedTech student sa isa ka GIA ay, \"\"GIA KA LANG, WALA KA RESPETO?\"\". Ginwarningan man lang sang isa ka GIA tong MedTech nga to kay gahod. Aba naman ateng, ikaw pinakamanggaranon sa buo nga school? Kung manggaranon ka man kay MedTech ka di ka mag-amo sana, MATAPOBRE sa imo. \n\n(Sorry guys, di ko GIA pero kalain abi ang ginhimo sang MedTech nga to)  \n\n- Anonymous", "id": "395931383856469_665228736926731"}, {"created_time": "2014-11-17T14:39:57+0000", "message": "\"Hello Maristas :)\n\nAsk ko lng po, sino po nakakita ng wallet sa school? sa creegan po ata kasi dun lang yung klase ko last thursday, may light brown then parang may animal face.. \nplease submit lang po sa DSA office, kahit yung Flash Drive and Rosary nlng po.... please lng po :( Thank you!\n\n#CAS\"", "id": "395931383856469_665228626926742"}, {"created_time": "2014-11-17T14:39:40+0000", "message": "\"Please Post\n\nSin.o Tung Naka NSTP Kagina man na Babae. May dala sang Guitar Tapos Naka Palda sang Black? \n\nPa Link Please. Gwapa To ba. <3 <3 \n\n-withCrush\"", "id": "395931383856469_665228476926757"}, {"created_time": "2014-11-17T14:39:28+0000", "message": "admin papost please.. i am a working student assign in the library.. i am not generalizing all the med-tech students in our school.. some of them (and i don't want to specify that student,u know who u are) are really acting like they are the most richest student in our university specially when they are inside the library... every time they entering the library they always keep on making noise even though they are being warn by the bell.. Yes,lets say your the wittiest students in our school, but don't you ever ask yourself how hard to maintain the study atmosphere in the library?? and your just going to say \"GIA KA LANG,WALA KA RESPETO\"?.. as a working student we respect all of the students,teachers and even visitors in our school.. so why dont you try to take off your shoes and take over our job as a working students and we'll going to say that to you also..what actually feelings will u feel?? hindi lang po trabaho ang inaatupag namin..nag-aaral din po kame at katulad nyo estudyante din kme,we just deffer in the mode of payments. kung ikaw cash to cash, kame dugo at pawis,pinagtatrabahuan namin ang anu mang pera na binabayad ng paaralan para sa aming pagaaral..we have also the right to fight for dignity as well as you.. we are part of this institution and we are just following the rules and regulations that the school is being imposed.. i just want to remind everybody that we are not JUST A WORKING, we WORKING STUDENTS and we are proud of being one.. P.S.: logically, literally, subjectively: imagine the school without us. \"if you want to be respected,you should respect others too.\n\n-Anonymous", "id": "395931383856469_665228363593435"}, {"created_time": "2014-11-17T14:37:55+0000", "message": "\"Hayyy! Kaulugot gd tana ang mga tricycle drivers nga gapungko da sa gwa gate ba. Gatulok gd sa palda namon kung magbaba kmi sa tricycle! 😡😡😡😡😡😡😡😡😡😡😡😡😡\n\n- UGHHHH \"", "id": "395931383856469_665227836926821"}, {"created_time": "2014-11-17T14:37:46+0000", "message": "I have seen a lot in my lifetime even tho I'm young. I've gone through the car crash, the abuse, some of the college and now, what do you know, the truth of life. It was a windy day when I saw a flyer on the school's hallway floor that told about a page called \"The Truth Contest\" and its top entry \"The Present\". So, I decided to check it out and read the top entry. Now I've gone through an intense transformation of perspective and I'm confused... But very fulfilled. Life has become a grand ride. Enjoy it while you have it. Whoever dropped that paper with that link, thank you.\n\n-Anonymous", "id": "395931383856469_665227750260163"}, {"created_time": "2014-11-17T14:35:19+0000", "message": "\"\"\"sa sobrang iwas mo para mawala ang nararamdaman mo para sa kanya , ang pagkakaibigan niyong nabuo ay unti-unti ding nawawala.\"\"\n\nHaha.God Bless na lang sayo :)\n\n#WhoGoat\n\n-Her", "id": "395931383856469_665226883593583"}, {"created_time": "2014-11-17T14:35:00+0000", "message": "\"Hi!!!!!\n\nNagtataka lang po ako kung bakit di ko na nakikita si Bill de Guzman sa school pero kapag outside campus nakikita ko po siya.\nTotoo po bang lumipat na siya?\n\nThankie 😉\n\n-Girly\"", "id": "395931383856469_665226730260265"}, {"created_time": "2014-11-17T14:34:30+0000", "message": "\"May girl dati nga kaMU ko then subong nbalan ko nga sila gali sang kilala ko. As in na BV gd ko. Dati si girl dasig-dasig gid na siya magreply saakon nga message. Then now,well let's say there's so much space. Ngaa wala siya gapanapak nga gin friendzone ya naman ko???or basi asta subong may gusto japon siya saakon.    \n#nanDING\"", "id": "395931383856469_665226523593619"}, {"created_time": "2014-11-17T14:34:00+0000", "message": "\"Admin sana ma post ito. \n\nSa nakakuha sang USB ko nga 16 GB na kulay blue sa NETSPOT 01 sa Alunan Street alas 11:00 sang gab i, please lang gd pakibalik lang sa tag iya sang netspot. Konsensya lang gd may importante lang gd nga files didto. Sa 29 na unit sa taas to siya. Usernmae sang USB kay JAVER nakabutang. \n\n#konsensya lang gd \n#huhuhu\n\n-AllstAR\"", "id": "395931383856469_665226373593634"}, {"created_time": "2014-11-17T14:33:43+0000", "message": "\"HI Admin, tung NDEA abi ni tan'aw ko sing saot, nang hiphop dance contest, tapos, galing tong nag saot na ang Marist Street, gi hanap ko gid ya si Christine Joy Guaro. Di abi siya gi sugutan sang iya nga mama na mag saot siya ba. Late Congrats gali sainyo. Miss ko na gid ya ang NDMU.\n\n-JPIA'18\"", "id": "395931383856469_665226243593647"}, {"created_time": "2014-11-17T14:33:22+0000", "message": "\"admin permission to post :D\nthanks :D\n\nask lang taad ko kung may FOREVER sa campus ta ??\nthank you :D\n\n-J.E.S", "id": "395931383856469_665226096926995"}, {"created_time": "2014-11-17T14:33:05+0000", "message": "\"Iba talaga pagkaklase mo ang crush mo. Yung feeling na parati kang active sa class para lang mapansin ka niya at para hindi ka mapahiya dahil may ibubuga ka.\n\nLalala. Guess who\"", "id": "395931383856469_665225983593673"}, {"created_time": "2014-11-17T14:32:49+0000", "message": "\"I met a guy na transfere.\nGaling siya sa manila na school (I won't mention the name of the school)\n\nSo dito nagsimula ang lahat:\nUmupo ako sa tabi niya sa may alumni na upuan. Bigla nya akong pinansin\n\nHim: Ah, miss alam mo ba kung san banda yung Doherty 218?\nMe: Hah? Ah opo alam ko po *shock*\nHim: haha parang nakakita ka naman ng multo miss.\nIn my mind: *Ang pogi mo kasi*\nMe: Hehe pasensya na. (Nasa manila ba tayo? Tagalog tayo ngayon eh)\nHim: Salamat ha. Btw, Im *****. You?\nMe: ********. *Shake hands*\nHim: Nice meeting you. (america naman ngayon)\nMe: Nice meeting you too.\n*bell bell*\nHim: San room mo?\nMe: Doherty din. :)\nHim: Sabay na tayo.\nMe: Ah sige.\nHim: oh, ako na mag dala ng laptop mo.\nMe: naku wag na. Kaya ko na to\nHim: I insist. (yung totoo? Movie ba to? Shet)\nMe: sige...\nHim: San room mo?\nMe: Doherty 126\nHim: Sige ihahatid na kita.\n*nakakahiya*\nMe: Salamat ha?\nHim: No. Thank you. Dahil naniniwala na ako sa love at first sight.\nMe: O.O\nTapos umalis siya agad.\n\nClassmate: Sin-o to yot? New keke?\nMe: Hala hindi.\nCmate: Taychi mader? Kurugkurugon pa tatay mo?\nMe: Opo.\nCmate: Te nga daw gapamutla ka? Uso mag gamit lip tint ah.\nMe: Ara na si sir. Shut up na.\nCmate: Kung di mo to keke. Akon nalang to eh. Daw namit lgi to.\nMe: Gusto mo ma taychi?\nCmate: Ay ay ay!!! Ang mega ta na in love mga maninay!!!!\nMe: shhhh!\n\nHindi pa natapos dahil pag labas ko ng room naghihintay pala siya sa labas!!! Tang ina!!! Kinikilig na ako!!! Lumapit siya sakin. Tapos yung mga kaklase ko tinutukso na ako.\n\nHim: I forgot. Can I get ur number? *Bigay Iphone 5* (Mayaman!)\nMe: ah sige. *type type*\nHim: Salamat. Una na ako ha? Kitakits nalang\n\nCmates: Ahhhhh. Sino to siya yot?\n-Kekeru bakla!!!\n-Pano mo to nagayuma!!\n-Bet girl!!! Haba ng hair mo te!\n\nSo yan. Hanggang ngayon text text padin kami. Tapos napa ka gentlemen niya. Huhu I found it. NBSB pa naman ako. Take note: ako nalang VIRGIN sa barkada. But it wont happen. 1 year nalang graduate na ako. :)\n\n#RegularStudent101\"", "id": "395931383856469_665225903593681"}, {"created_time": "2014-11-17T14:28:41+0000", "message": "\"Hello! Kilala niyo si Sean Kent Lacanaria? Regards lang ko sa iya. \n\n- momoken\"", "id": "395931383856469_665224636927141"}]}